#include "bsp.h"

void Process_Debug(U8 *p)
{
	if(strstr((const char*)p,"list"))
	{
		printf("********************************************************\r\n");
		printf("******               调试菜单                    ******\r\n");
		printf("********************************************************\r\n");
		printf("请选择输入命令（十六进制发送）\r\n");
		printf("命令：AA050B010000000000A5，动作：开机初始化\r\n");
		printf("命令：AA05003000XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：水平电机(MT1)运行到什么位置\r\n");
		printf("命令：AA05013000XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：垂直电机(MT2)运行到什么位置\r\n");
		printf("命令：AA05023000XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：反应盘(MT3)运行到什么位置\r\n");
		printf("命令：AA05033000XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：精密泵电机2(MT4)运行到什么位置\r\n");
		printf("命令：AA0504300000000000(XX表示步数：例如10000步请输入10270000)A5，动作：清洗臂电机(MT5)运行到什么位置\r\n");
		printf("命令：AA0505300000000000(XX表示步数：例如10000步请输入10270000)A5，动作：擦拭臂电机(MT6)运行到什么位置\r\n");
		printf("命令：AA0500310000000000A5，动作：水平电机(MT1)复位\r\n");
		printf("命令：AA0501310000000000A5，动作：垂直电机(MT2)复位\r\n");
		printf("命令：AA0502310000000000A5，动作：反应盘(MT3)复位\r\n");
		printf("命令：AA0503310000000000A5，动作：精密泵电机2(MT4)复位\r\n");
		printf("命令：AA0504310000000000A5，动作：清洗臂电机(MT5)复位\r\n");
		printf("命令：AA0505310000000000A5，动作：擦拭臂电机(MT6)复位\r\n");
		printf("命令：AA0500DA01XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置水平电机(MT1) 移动到清洗盘的步数\r\n");		
		printf("命令：AA0501DA01XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置垂直电机(MT2)移动到清洗盘的步数\r\n");
		printf("命令：AA0501DA02XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置混匀针(MT2)到清洗位置步数\r\n");		
		printf("命令：AA0502DA01XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置反应盘电机(MT3)移动一个孔位的步数\r\n");
		printf("命令：AA0502DA02XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置反应盘电机(MT3)工作点偏移步数\r\n");
		printf("命令：AA0504DA01XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置清洗臂电机(MT5)移动到清洗盘的步数\r\n");
		printf("命令：AA0505DA01XXXXXXXX(XX表示步数：例如10000步请输入10270000)A5，动作：设置擦拭臂电机(MT6)移动到清洗盘的步数\r\n");
		printf("命令：AA05103700XXXXXXXX(XX表示清洗时间（单位：100ms）)A5，动作：混匀针清洗槽内壁清洗\r\n");
		printf("命令：AA05103800XXXXXXXX(XX表示清洗时间（单位：100ms）)A5，动作：混匀针外壁清洗\r\n");
		printf("命令：AA05103900XXXXXXXX(XX表示清洗时间（单位：100ms）)A5，动作：混匀针内壁清洗\r\n");
		printf("命令：AA051050XX(n号杯子)XX(设置吸抽次数)XXXXXX(设置注水时间（单位：100ms）)A5，动作：清洗n号杯子\r\n");
		printf("命令：AA051051XX(n号杯子)XXXXXXXX(设置擦拭时间（单位：100ms）)A5，动作：擦拭n号杯子\r\n");
		printf("命令：AA051052XX(n号杯子)XXXXXXXX(设置抽吸次数)A5，动作：混匀n号杯子\r\n");
		printf("命令：AA051053XX(n号杯子)XXXXXX(设置吸样量（0-500ul))XX(n1号杯子)A5，动作：n号杯子吸 100ul到n1杯子\r\n");
		printf("命令：AA051054XX(n号杯子)00000000A5，动作：混匀盘移动到n号杯子加样品\r\n");		
		printf("命令：AA051015XX(Bit1表示泵1，Bit2表示泵2...，1表示打开，0表示关闭)00000000A5，动作：操作泵\r\n");
		printf("命令：AA051016XX(Bit1表示阀1，Bit2表示阀2...，1表示打开，0表示关闭)00000000A5，动作：操作阀\r\n");		
		printf("命令：AA0510DB0000000000A5，动作：保存设置的系统参数\r\n");
		printf("命令：AA0510DC0000000000A5，动作：读取系统参数\r\n");
		printf("命令：AA0510400000000000A5，动作：获取下位机版本号\r\n");
		printf("命令：AA0510600000000000A5，动作：开始老化\r\n");		
		printf("命令：AA0510610000000000A5，动作：停止老化\r\n");
        printf("命令：AA0510700000000000A5，动作：获取温度\r\n");
		printf("********************************************************\r\n");	
	}
	if(strstr((const char*)p,"qx"))
	{
		MULT_MOTOR_PARAM *mp = GetMotorParam_MD(MOTOR3);
		for(U16 i = 0;i<36;i++)
    {
				printf("%d\r\n",mp->cutPos);
			//清洗i号杯子
        Clean_ReactingCup(i,3,120);
        //擦拭i号杯子,2S
        Wiping_ReactingCup(i,20);
			
    }
	}
	if(strstr((const char*)p,"next"))
	{
		SetMotorMoveParam(MOTOR3, 1, 3200);
	}
}
